# ========================================= Задание 1 ==========================================
print('TASK I')
q = 1
s = 'строка'
print(q, s)
q = input('Введите число ')
print(q)
s = input('Введите строку ')
print(s)

# ========================================= Задание 2 ==========================================
print('TASK II')
time_is_sec = int(input('Введите время в секудах = '))
ss = time_is_sec%60
hh = time_is_sec // 3600
mm = abs(time_is_sec // 60 - 60 * hh)
print(F'Время в формате чч:мм:сс = {hh}:{mm}:{ss}')

# ========================================= Задание 3 ==========================================
print('TASK III')
n = int(input('Введите число = '))
n = n + n * 11 + n * 111
print(n)

# ========================================= Задание 4 ==========================================
print('TASK IV')
n = input('Введите целое положительное число = ')
i = 1
m = n[0]
while i < len(n):
    if n[i] > m:
        m = n[i]
    i = i + 1
print(m)

# ========================================= Задание 5 ==========================================
print('TASK V')
revenue = float(input('Введите выручку = '))
expenses = float(input('Введите издержки = '))
profit = revenue - expenses
if profit > 0:
    print(F'Результат: прибыль = {profit}')
    print(F'Рентабельность = {revenue/profit}')
    p_count = int(input('Введите количество сотрудников = '))
    print(F'Прибыль фирмы в расчете на одного сотрудника = {profit/p_count}')
elif profit == 0:
    print('Результат: сработали в ноль')
else:
    print('Результат: убылок')

# ========================================= Задание 6 ==========================================
print('TASK VI')
k_count = int(input('Введите результат за 1 день, км = '))
r_count = int(input('Введите цель, км = '))
i = 2
print('1-й день:', k_count)
while k_count < r_count:
    k_count = round(k_count + k_count * 0.1, 2)
    print(F'{i}-й день: {k_count}')
    i = i + 1
